burakenez/gd32e51x-cmake-vscode/Examples/USBD/custom_hid/GD32E51x_HD.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC0</name>
      <description>Digital-to-analog converter</description>
      <groupName>DAC</groupName>
      <baseAddress>0x40007400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL0</name>
          <displayName>CTL0</displayName>
          <description>control register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DEN0</name>
              <description>DAC0 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBOFF0</name>
              <description>DAC0 output buffer turn off</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEN0</name>
              <description>DAC0 trigger enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTSEL0</name>
              <description>DAC0 trigger selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DWM0</name>
              <description>DAC0 noise wave mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DWBW0</name>
              <description>DAC0 noise wave bit width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DDMAEN0</name>
              <description>DAC0 DMA enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDUDRIE0</name>
              <description>DAC_OUT0 DMA underrun interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTSEL0_3</name>
              <description>DAC_OUT0 trigger selection bit[3], refer to DTSEL0[2:0]</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>DDISC0</name>
              <description>DACx_OUT0 connect GPIO selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>DEN1</name>
              <description>DAC1 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBOFF1</name>
              <description>DAC1 output buffer turn off</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEN1</name>
              <description>DAC1 trigger enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTSEL1</name>
              <description>DAC1 trigger selection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DWM1</name>
              <description>DAC1 noise wave mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DWBW1</name>
              <description>DAC1 noise wave bit width</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DDMAEN1</name>
              <description>DAC1 DMA enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDUDRIE1</name>
              <description>DAC_OUT1 DMA underrun interrupt enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTSEL1_3</name>
              <description>DAC_OUT1 trigger selection bit[3], refer to DTSEL1[2:0]</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>DDISC1</name>
              <description>DACx_OUT1 connect GPIO selection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWT</name>
          <displayName>SWT</displayName>
          <description>software trigger register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWTR0</name>
              <description>DAC0 software trigger</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWTR1</name>
              <description>DAC1 software trigger</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT0_R12DH</name>
          <displayName>OUT0_R12DH</displayName>
          <description>DAC_OUT0 12-bit right-aligned data holding register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT0_DH</name>
              <description>DAC_OUT0 12-bit right-aligned
              data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT0_L12DH</name>
          <displayName>OUT0_L12DH</displayName>
          <description>DAC_OUT0 12-bit left-aligned data holding register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT0_DH</name>
              <description>DAC_OUT0 12-bit left-aligned
              data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT0_R8DH</name>
          <displayName>OUT0_R8DH</displayName>
          <description>DAC_OUT0 8-bit right aligned data holding
          register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT0_DH</name>
              <description>DAC_OUT0 8-bit right-aligned
              data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>OUT1_R12DH</name>
          <displayName>OUT1_R12DH</displayName>
          <description>DAC_OUT1 12-bit right-aligned data holding
          register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT1_DH</name>
              <description>DAC_OUT1 12-bit right-aligned
              data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1_L12DH</name>
          <displayName>OUT1_L12DH</displayName>
          <description>DAC_OUT1 12-bit left aligned data holding
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT1_DH</name>
              <description>DAC_OUT1 12-bit left-aligned
              data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1_R8DH</name>
          <displayName>OUT1_R8DH</displayName>
          <description>DAC_OUT1 8-bit right aligned data holding
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT1_DH</name>
              <description>DAC_OUT1 8-bit right-aligned
              data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>DACC_R12DH</name>
          <displayName>DACC_R12DH</displayName>
          <description>DAC concurrent mode 12-bit right-aligned data holding
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT0_DH</name>
              <description>DAC_OUT0 12-bit right-aligned
              data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>OUT1_DH</name>
              <description>DAC_OUT1 12-bit right-aligned
              data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DACC_L12DH</name>
          <displayName>DACC_L12DH</displayName>
          <description>DAC concurrent mode 12-bit left aligned data holding
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT0_DH</name>
              <description>DAC_OUT0 12-bit left-aligned
              data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
           <field>
              <name>OUT1_DH</name>
              <description>DAC_OUT1 12-bit left-aligned
              data</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DACC_R8DH</name>
          <displayName>DACC_R8DH</displayName>
          <description>DAC concurrent mode 8-bit right aligned data holding
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT0_DH</name>
              <description>DAC_OUT0 8-bit right-aligned
              data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>OUT1_DH</name>
              <description>DAC_OUT1 8-bit right-aligned
              data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT0_DO</name>
          <displayName>DAC0_DO</displayName>
          <description>DAC_OUT0 data output register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT0_DO</name>
              <description>DAC_OUT0 data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>OUT1_DO</name>
          <displayName>OUT1_DO</displayName>
          <description>DAC_OUT1 data output register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT1_DO</name>
              <description>DAC_OUT1 data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>STAT0</name>
          <displayName>STAT0</displayName>
          <description>DAC Status register 0</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DDUDR1</name>
              <description>DAC_OUT1 DMA underrun flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDUDR0</name>
              <description>DAC_OUT0 DMA underrun flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CTL1</name>
          <displayName>CTL1</displayName>
          <description>DAC Control Register 1</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFOUDRIE1</name>
              <description>DAC_OUT1 FIFO underflow interrupt enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOOVRIE1</name>
              <description>DAC_OUT1 FIFO overflow interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOEN1</name>
              <description>DAC_OUT1 data FIFO enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOUDRIE0</name>
              <description>DAC_OUT0 FIFO underflow interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOOVRIE0</name>
              <description>DAC_OUT0 FIFO overflow interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOEN0</name>
              <description>DAC_OUT0 data FIFO enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>STAT1</name>
          <displayName>STAT1</displayName>
          <description>DAC Status register 1</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>FIFONUM1</name>
              <description>Number of data in the DAC_OUT1 FIFO</description>
              <access>read-only</access>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FIFOUDR1</name>
              <description>DAC_OUT1 FIFO underflow flag</description>
              <access>read-write</access>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOOVR1</name>
              <description>DAC_OUT1 FIFO overflow flag</description>
              <access>read-write</access>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FE1</name>
              <description>DAC_OUT1 FIFO empty flag</description>
              <access>read-only</access>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FF1</name>
              <description>DAC_OUT1 FIFO full flag</description>
              <access>read-only</access>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFONUM0</name>
              <description>Number of data in the DAC_OUT0 FIFO</description>
              <access>read-only</access>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FIFOUDR0</name>
              <description>DAC_OUT0 FIFO underflow flag</description>
              <access>read-write</access>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOOVR0</name>
              <description>DAC_OUT0 FIFO overflow flag</description>
              <access>read-write</access>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FE0</name>
              <description>DAC_OUT0 FIFO empty flag</description>
              <access>read-only</access>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FF0</name>
              <description>DAC_OUT0 FIFO full flag</description>
              <access>read-only</access>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
