burakenez/gd32e51x-cmake-vscode/Examples/USBD/custom_hid/GD32E51x_HD.svd
        <register>
          <name>ST1CNTRST</name>
          <displayName>ST1CNTRST</displayName>
          <description>SHRTIMER Slave_TIMERx counter reset register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST4CMP3RST</name>
              <description>Slave_TIMER4 compare 3 event resets counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CMP1RST</name>
              <description>Slave_TIMER4 compare 1 event resets counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CMP0RST</name>
              <description>Slave_TIMER4 compare 0 event resets counter</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CMP3RST</name>
              <description>Slave_TIMER3 compare 3 event resets counter</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CMP1RST</name>
              <description>Slave_TIMER3 compare 1 event resets counter</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CMP0RST</name>
              <description>Slave_TIMER3 compare 0 event resets counter</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CMP3RST</name>
              <description>Slave_TIMER2 compare 3 event resets counter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CMP1RST</name>
              <description>Slave_TIMER2 compare 1 event resets counter</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CMP0RST</name>
              <description>Slave_TIMER2 compare 0 event resets counter</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CMP3RST</name>
              <description>Slave_TIMER0 compare 3 event resets counter</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CMP1RST</name>
              <description>Slave_TIMER0 compare 1 event resets counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CMP0RST</name>
              <description>Slave_TIMER0 compare 0 event resets counter</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV9RST</name>
              <description>External event 9 resets counter</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV8RST</name>
              <description>External event 8 resets counter</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV7RST</name>
              <description>External event 7 resets counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV6RST</name>
              <description>External event 6 resets counter</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV5RST</name>
              <description>External event 5 resets counter</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV4RST</name>
              <description>External event 4 resets counter</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV3RST</name>
              <description>External event 3 resets counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV2RST</name>
              <description>External event 2 resets counter</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV1RST</name>
              <description>External event 1 resets counter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXEV0RST</name>
              <description>External event 0 resets counter</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP3RST</name>
              <description>Master_TIMER compare 3 event resets counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP2RST</name>
              <description>Master_TIMER compare 2 event resets counter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP1RST</name>
              <description>Master_TIMER compare 1 event resets counter</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP0RST</name>
              <description>Master_TIMER compare 0 event resets counter</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTPERRST</name>
              <description>Master_TIMER period event resets counter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP3RST</name>
              <description>Slave_TIMER1 compare 3 event resets counter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1RST</name>
              <description>Slave_TIMER1 compare 1 event resets counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPRST</name>
              <description>Slave_TIMER1 update event resets counter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST1CSCTL</name>
          <displayName>ST1CSCTL</displayName>
          <description>SHRTIMER Slave_TIMERx carrier-signal control register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSFSTPW</name>
              <description>First carrier-signal pulse width</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CSDTY</name>
              <description>Carrier signal duty cycle</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPRD</name>
              <description>Carrier signal period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST1CAP0TRG</name>
          <displayName>ST1CAP0TRG</displayName>
          <description>SHRTIMER Slave_TIMERx capture 0 trigger register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CP0BST1CMP1</name>
              <description>Capture 0 triggered by compare 1 event of Slave_TIMER1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BST1CMP0</name>
              <description>Capture 0 triggered by compare 0 event of Slave_TIMER1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BST1NA</name>
              <description>Capture 0 triggered by ST1CH0_O output active to inactive transition</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BST1A</name>
              <description>Capture 0 triggered by ST1CH0_O output inactive to active transition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV9</name>
              <description>Capture 0 triggered by external event 9</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV8</name>
              <description>Capture 0 triggered by external event 8</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV7</name>
              <description>Capture 0 triggered by external event 7</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV6</name>
              <description>Capture 0 triggered by external event 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV5</name>
              <description>Capture 0 triggered by external event 5</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV4</name>
              <description>Capture 0 triggered by external event 4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV3</name>
              <description>Capture 0 triggered by external event 3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV2</name>
              <description>Capture 0 triggered by external event 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV1</name>
              <description>Capture 0 triggered by external event 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BEXEV0</name>
              <description>Capture 0 triggered by external event 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BUP</name>
              <description>Capture 0 triggered by update event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0BSW</name>
              <description>Capture 0 triggered by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST1CAP1TRG</name>
          <displayName>ST1CAP1TRG</displayName>
          <description>SHRTIMER Slave_TIMERx capture 1 trigger register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CP1BST1CMP1</name>
              <description>Capture 1 triggered by compare 1 event of Slave_TIMER1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BST1CMP0</name>
              <description>Capture 1 triggered by compare 0 event of Slave_TIMER1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BST1NA</name>
              <description>Capture 1 triggered by ST1CH0_O output active to inactive transition</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BST1A</name>
              <description>Capture 1 triggered by ST1CH0_O output inactive to active transition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV9</name>
              <description>Capture 1 triggered by external event 9</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV8</name>
              <description>Capture 1 triggered by external event 8</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV7</name>
              <description>Capture 1 triggered by external event 7</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV6</name>
              <description>Capture 1 triggered by external event 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV5</name>
              <description>Capture 1 triggered by external event 5</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV4</name>
              <description>Capture 1 triggered by external event 4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV3</name>
              <description>Capture 1 triggered by external event 3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV2</name>
              <description>Capture 1 triggered by external event 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV1</name>
              <description>Capture 1 triggered by external event 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BEXEV0</name>
              <description>Capture 1 triggered by external event 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BUP</name>
              <description>Capture 1 triggered by update event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP1BSW</name>
              <description>Capture 1 triggered by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
      </register>
       <register>
          <name>ST1CHOCTL</name>
          <displayName>ST1CHOCTL</displayName>
          <description>SHRTIMER Slave_TIMERx channel output control register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMCH1DTI</name>
              <description>Channel 1 dead-time insert in bunch mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1CSEN</name>
              <description>Channel 1 carrier-signal mode enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1FLTOS</name>
              <description>Channel 1 Fault output state</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ISO1</name>
              <description>channel 1 output idle state</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMCH1IEN</name>
              <description>Channel 1 IDLE state enable in bunch mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1P</name>
              <description>Channel 1 output polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLYISCH</name>
              <description>Delayed IDLE source and channel</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYISMEN</name>
              <description>Delayed IDLE state mode enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEN</name>
              <description>Dead time enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMCH0DTI</name>
              <description>Channel 0 dead-time insert in bunch mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0CSEN</name>
              <description>Channel 0 carrier-signal mode enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0FLTOS</name>
              <description>Channel 0 Fault output state</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ISO0</name>
              <description>Channel 0 output idle state</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMCH0IEN</name>
              <description>Channel 0 IDLE state enable in bunch mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0P</name>
              <description>Channel 0 output polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
      </register>
       <register>
          <name>ST1FLTCTL</name>
          <displayName>ST1FLTCTL</displayName>
          <description>SHRTIMER Slave_TIMERx fault control register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLTENPROT</name>
              <description>Protect fault enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4EN</name>
              <description>Fault 4 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3EN</name>
              <description>Fault 3 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2EN</name>
              <description>Fault 2 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT1EN</name>
              <description>Fault 1 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT0EN</name>
              <description>Fault 0 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
      </register>
