burakenez/gd32e51x-cmake-vscode/Examples/USBD/custom_hid/GD32E51x_HD.svd
        <register>
          <name>STATC</name>
          <displayName>STATC</displayName>
          <description>Status clear register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMBALTC</name>
              <description>SMBus Alert flag clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMEOUTC</name>
              <description>TIMEOUT flag clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PECERRC</name>
              <description>PEC error flag clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUERRC</name>
              <description>Overrun/Underrun flag clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOSTARBC</name>
              <description>Arbitration Lost flag clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERRC</name>
              <description>Bus error flag clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STPDETC</name>
              <description>STPDET flag clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACKC</name>
              <description>Not Acknowledge flag clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDSENDC</name>
              <description>ADDSEND flag clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEC</name>
          <displayName>PEC</displayName>
          <description>Packet Error Checking</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PECV</name>
              <description>Packet Error Checking Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA</name>
          <displayName>RDATA</displayName>
          <description>receive data register </description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Receive data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TDATA</name>
          <displayName>TDATA</displayName>
          <description>Transmit data register </description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TDATA</name>
              <description>Transmit data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
</peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt
      Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xF00</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x33D</offset>
        <size>0xC3</size>
        <usage>reserved</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ISER</name>
          <displayName>ISER</displayName>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETENA</name>
              <description>SETENA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICER</name>
          <displayName>ICER</displayName>
          <description>Interrupt Clear Enable
          Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>CLRENA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISPR</name>
          <displayName>ISPR</displayName>
          <description>Interrupt Set-Pending Register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>SETPEND</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICPR</name>
          <displayName>ICPR</displayName>
          <description>Interrupt Clear-Pending
          Register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>CLRPEND</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>IABR</name>
          <displayName>IABR</displayName>
          <description>Interrupt Active bit
          Register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IABR</name>
              <description>IABR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR0</name>
          <displayName>IPR0</displayName>
          <description>Interrupt Priority Register 0</description>
          <addressOffset>0x300</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_00</name>
              <description>PRI_00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>IPR1</name>
          <displayName>IPR1</displayName>
          <description>Interrupt Priority Register 1</description>
          <addressOffset>0x301</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_01</name>
              <description>PRI_01</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR2</name>
          <displayName>IPR2</displayName>
          <description>Interrupt Priority Register 2</description>
          <addressOffset>0x302</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_02</name>
              <description>PRI_02</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register> 
     <register>
          <name>IPR3</name>
          <displayName>IPR3</displayName>
          <description>Interrupt Priority Register 3</description>
          <addressOffset>0x303</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_03</name>
              <description>PRI_03</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR4</name>
          <displayName>IPR4</displayName>
          <description>Interrupt Priority Register 4</description>
          <addressOffset>0x304</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_04</name>
              <description>PRI_04</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR5</name>
          <displayName>IPR5</displayName>
          <description>Interrupt Priority Register 5</description>
          <addressOffset>0x305</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_05</name>
              <description>PRI_05</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR6</name>
          <displayName>IPR6</displayName>
          <description>Interrupt Priority Register 6</description>
          <addressOffset>0x306</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_06</name>
              <description>PRI_06</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR7</name>
          <displayName>IPR7</displayName>
          <description>Interrupt Priority Register 7</description>
          <addressOffset>0x307</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_07</name>
              <description>PRI_07</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR8</name>
          <displayName>IPR8</displayName>
          <description>Interrupt Priority Register 8</description>
          <addressOffset>0x308</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_08</name>
              <description>PRI_08</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR9</name>
          <displayName>IPR9</displayName>
          <description>Interrupt Priority Register 9</description>
          <addressOffset>0x309</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_09</name>
              <description>PRI_09</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR10</name>
          <displayName>IPR10</displayName>
          <description>Interrupt Priority Register 10</description>
          <addressOffset>0x30A</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_10</name>
              <description>PRI_10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR11</name>
          <displayName>IPR11</displayName>
          <description>Interrupt Priority Register 11</description>
          <addressOffset>0x30B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_11</name>
              <description>PRI_11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR12</name>
          <displayName>IPR12</displayName>
          <description>Interrupt Priority Register 12</description>
          <addressOffset>0x30C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_12</name>
              <description>PRI_12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR13</name>
          <displayName>IPR13</displayName>
          <description>Interrupt Priority Register 13</description>
          <addressOffset>0x30D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_13</name>
              <description>PRI_13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR14</name>
          <displayName>IPR14</displayName>
          <description>Interrupt Priority Register 14</description>
          <addressOffset>0x30E</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_14</name>
              <description>PRI_14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR15</name>
          <displayName>IPR15</displayName>
          <description>Interrupt Priority Register 15</description>
          <addressOffset>0x30F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_15</name>
              <description>PRI_15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR16</name>
          <displayName>IPR16</displayName>
          <description>Interrupt Priority Register 16</description>
          <addressOffset>0x310</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_16</name>
              <description>PRI_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR17</name>
          <displayName>IPR17</displayName>
          <description>Interrupt Priority Register 17</description>
          <addressOffset>0x311</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_17</name>
              <description>PRI_17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR18</name>
          <displayName>IPR18</displayName>
          <description>Interrupt Priority Register 18</description>
          <addressOffset>0x312</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_18</name>
              <description>PRI_18</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR19</name>
          <displayName>IPR19</displayName>
          <description>Interrupt Priority Register 19</description>
          <addressOffset>0x313</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_19</name>
              <description>PRI_19</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR20</name>
          <displayName>IPR20</displayName>
          <description>Interrupt Priority Register 20</description>
          <addressOffset>0x314</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_20</name>
              <description>PRI_20</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR21</name>
          <displayName>IPR21</displayName>
          <description>Interrupt Priority Register 21</description>
          <addressOffset>0x315</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_21</name>
              <description>PRI_21</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR22</name>
          <displayName>IPR22</displayName>
          <description>Interrupt Priority Register 22</description>
          <addressOffset>0x316</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_22</name>
              <description>PRI_22</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR23</name>
          <displayName>IPR23</displayName>
          <description>Interrupt Priority Register 23</description>
          <addressOffset>0x317</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_23</name>
              <description>PRI_23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR24</name>
          <displayName>IPR24</displayName>
          <description>Interrupt Priority Register 24</description>
          <addressOffset>0x318</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_24</name>
              <description>PRI_24</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR25</name>
          <displayName>IPR25</displayName>
          <description>Interrupt Priority Register 25</description>
          <addressOffset>0x319</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_25</name>
              <description>PRI_25</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR26</name>
          <displayName>IPR26</displayName>
          <description>Interrupt Priority Register 26</description>
          <addressOffset>0x31A</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_26</name>
              <description>PRI_26</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR27</name>
          <displayName>IPR27</displayName>
          <description>Interrupt Priority Register 27</description>
          <addressOffset>0x31B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_27</name>
              <description>PRI_27</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
